CFD_UC/UC_2/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.02257;
boundaryField
{
  ".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

  WB_inlet
  {
    type fixedValue;
    value uniform 0.02257;
  }

  WB_outlet
  {
    type inletOutlet;
    inletValue $internalField;
    value uniform 0.0;
  }


  WB_waterbox
  {
    type kqRWallFunction;
    value uniform 0;
  }

  "procBoundary.*"
  {
    type processor;
    value $internalField;
  }
    #include "include/frontBackUpperPatches"

}

